Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །མཐོང་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་མཆོག་ཏུ་དགའ་བ་དང་། བདེ་བ་སྐྱེས་ཏེ།
en: The bodhisattva mahāsattvas became perfectly joyous and happy when they saw that.

source: འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་རང་རང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་བོར་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ལ་མཆོད་པ་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་རྫུ་འཕྲུལ་གྱི་མཐུས་འཇིག་རྟེན་གྱི་ཁམས་པད་མར་ལྷགས་སོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པ་དེས་ཀྱང་བཞུགས་པ་དང་། བཞེངས་པ་དང་།
en: Countless bodhisattvas, from realms as numerous as the particles in a buddha realm, through their miraculous powers left their buddha realms and came to the Padmā realm in order to make offerings to, pay homage to, and honor the tathāgata arhat samyaksam­buddha Padmottara. “

source: འཆགས་བཞིན་དུ་ཞལ་གྱི་སྒོ་ནས་ལྗགས་ཀྱི་དབང་པོ་ཕྱུང་སྟེ་ཐམས་ཅད་དང་ལྡན་པའི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ལྗགས་ཀྱི་དབང་པོས་ཡོངས་སུ་ཁེབས་པར་མཛད་དོ།
en: Noble son, the Tathāgata Padmottara, while sitting, standing, and walking, extended his tongue from his mouth and covered that entire world of four continents with his tongue.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྙོམས་པར་ཞུགས་པ་དེ་དག་ཀྱང་ཏིང་ངེ་འཛིན་ལས་ལངས་ནས་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་མཆོད་པ་བྱ་བའི་ལས་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: Then the bodhisattvas who were in meditation arose from their samādhi and applied themselves to making offerings to the Tathāgata and the entire assembly. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པས་ལྗགས་ཀྱི་དབང་པོའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པའི་ཕྱིར་བསྡུས་ནས། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པས་སྐུ་ཐམས་ཅད་ནས་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ཀྱི་སྤུའི་ཁུང་བུའི་སྒོ་རེ་རེ་ནས་ཀྱང་།
en: Noble son, when the Tathāgata Padmottara ceased manifesting the miraculous power of his tongue, he emitted six thousand trillion light rays from each pore of his entire body.

source: འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དྲུག་ཅུ་དྲུག་ཅུ་བྱུང་ཞིང་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་མཛད་ནས།
en: This vast radiance reached realms in all the ten directions as numerous as the particles in a buddha realm.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ལུང་བསྟན་པ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཏིང་ངེ་འཛིན་ཐོབ་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ལ་བལྟ་བ་དང་།
en: There were bodhisattva mahāsattvas in those realms who received prophecies and attained samādhi.

source: ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་སྣང་བ་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་པད་མར་ལྷགས་སོ། །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པས་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་དེ་ཕྱིར་བསྡུས་ནས། སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་།
en: Those bodhisattva mahāsattvas, through their miraculous powers, departed from their own buddha realms and came to the Padmā realm in order to see, pay homage to, and honor the tathāgata arhat samyaksam­buddha Padmottara. “

source: སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་། བདེ་བ་དང་། ཐེག་པ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ལ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱ་བ་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏོ།
en: Noble son, when the tathāgata arhat samyaksam­buddha Padmottara concluded his miraculous manifestations, in order to benefit many beings, for the sake of the happiness of many beings, from compassion for the world, in order to bring benefit and happiness to devas and humans, and in order to perfectly complete the purpose of the Mahāyāna, he turned the righteous wheel of the Dharma called the Irreversible Wheel for the entire assembly of bodhisattvas.”

source: །ཐེག་པ་ཆེན་པོའི་མདོ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ལས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: That concludes “Turning the Wheel of the Dharma,” which is the first chapter of the Mahāyāna sūtra titled The White Lotus of Compassion.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་དེ་ན་མཚན་མོ་དང་ཉིན་མོར་ནི་ཇི་ལྟར་འཚལ།
en: The Dhāraṇī Entranceway Chapter 2 Then the bodhisattva Ratnavairocana asked the Bhagavat, “Bhadanta Bhagavat, how does one distinguish day and night in the Padmā realm?

source: དེ་ན་སྒྲ་ནི་ཇི་ལྟ་བུ་དག་གྲག །
en: What kinds of sounds are heard there?

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བསམ་པ་ནི་ཇི་ལྟ་བུ་དང་ལྡན།
en: What kind of mental states do the bodhisattvas there have?

source: གནས་པ་ནི་གང་གིས་གནས་ལགས།
en: What kind of dwelling do they dwell in?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ནི་རྟག་ཏུ་སངས་རྒྱས་ཀྱི་འོད་ཀྱིས་སྣང་བར་གྱུར་པ་ཡིན་ཏེ།
en: Noble son,” answered the Bhagavat, “the Padmā realm is continuously illuminated by the Buddha’s light.

source: དེ་ན་གང་གི་ཚེ་མེ་ཏོག་དག་ཁ་ཟུམས་པར་གྱུར་ཅིང་། བྱ་རྣམས་ཀྱང་སྒྲ་ཆུང་བར་གྱུར་པ་དང་། བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་བསམ་གཏན་དག་གིས་རོལ་ཅིང་རྣམ་པར་གྲོལ་བའི་དགའ་བ་དང་བདེ་བ་མྱོང་བར་མཛད་པ་དེའི་ཚེ་དེ་ན་མཚན་མོ་ཡིན་པར་ཤེས་སོ།
en: The time there that is known as night is when the flowers close, the songs of the birds diminish, and the Bhagavat and the bodhisattvas enjoy meditation and experience liberation’s joy and bliss.

source: །གང་གི་ཚེ་མེ་ཏོག་དེ་རླུང་གིས་ཁ་བྱེ་བར་གྱུར་ཅིང་བྱ་རྣམས་ཀྱང་སྒྲ་ཡིད་དུ་འོང་བ་སྒྲོགས་པར་བྱེད་པ་དང་། དེར་མེ་ཏོག་གི་ཆར་དག་ཀྱང་མངོན་པར་འབབ་པ་དང་། ཕྱོགས་བཞི་ནས་དྲི་མཆོག་ཏུ་ཞིམ་ཞིང་ཡིད་དུ་འོང་ལ་འཇམ་ཞིང་རེག་ན་བདེ་བར་འགྱུར་བའི་རླུང་དག་ལྡང་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱང་ཏིང་ངེ་འཛིན་ལས་བཞེངས་ལ།
en: The time that is known as day is when the flowers are opened by a breeze, the birds sing beautifully, a rain of flowers falls, and supremely fragrant, pleasant, gentle breezes, the touch of which is delightful, blow in the four directions.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཤིང་བཅོམ་ལྡན་འདས་པད་མ་དམ་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་གཏམ་ལས་ཤིན་ཏུ་འདས་པ་དག་སྟོན་པར་མཛད་པ་དེའི་ཚེ་དེ་ནི་ཉིན་མོ་ཡིན་པར་ཤེས་སོ།
en: The Bhagavat arises from his samādhi, the bodhisattvas arise from their samādhis, and the Bhagavat Padmottara teaches the bodhisattva mahāsattvas the bodhisattva piṭaka, which transcends completely what is spoken of to śrāvakas and pratyekabuddhas. “

source: །རིགས་ཀྱི་བུ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་མི་འབྲལ་ལོ། །མི་འཇིགས་པའི་སྒྲ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་སྒྲ་དང་། སྐྱེ་བ་མེད་པའི་སྒྲ་དང་།
en: Noble son, the bodhisattva mahāsattvas are never separated from the word Buddha, the word Dharma, or the word Saṅgha.

source: འགག་པ་མེད་པའི་སྒྲ་དང་། ཞི་བའི་སྒྲ་དང་། ཉེ་བར་ཞི་བའི་སྒྲ་དང་། རབ་ཏུ་ཞི་བའི་སྒྲ་དང་། བྱམས་པ་ཆེན་པོའི་སྒྲ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྒྲ་དང་།
en: They are never separated from the word fearlessness, the word nonformation, the word nonbecoming, the words no cessation, the word pacified, the words very pacified, the words truly pacified, the words great kindness, the words great compassion, the words unoriginated phenomena, the words attaining the level of consecration, or the words buddhas and bodhisattvas.

source: མི་སྐྱེ་བའི་ཆོས་ཀྱི་སྒྲ་དང་། དབང་བསྐུར་བའི་ས་ཐོབ་པའི་སྒྲ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་སྒྲ་དང་མི་འབྲལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་རྟག་ཏུ་སྒྲ་དེ་ལྟ་བུ་དག་ཉན་པར་བྱེད་དོ།
en: The bodhisattvas continually hear words such as these. “

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་པད་མར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་ཞིང་། འོད་དཔག་ཚད་བརྒྱ་པ་ཡོད་ལ་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་རྣམ་པར་མི་ལྟུང་བའི་ཆོས་ཅན་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ནི་བྱམས་པའི་སེམས་དང་ལྡན་པ་དང་། སྣུམ་པའི་སེམས་དང་ལྡན་པ་དང་། རྙོག་པ་མེད་པའི་སེམས་དང་ལྡན་པ་དང་། དུལ་བའི་སེམས་དང་ལྡན་པ་དང་། སྤྲོ་རིང་བའི་སེམས་དང་ལྡན་པ་དང་། མཉམ་པར་བཞག་པའི་སེམས་དང་ལྡན་པ་དང་། རབ་ཏུ་དང་བའི་སེམས་དང་ལྡན་པ་དང་།
en: Noble son, moreover, the bodhisattva mahāsattvas who have been born and will be born in the Padmā world are all endowed with the thirty-two signs of a great being, have hundred-yojana-wide auras, and until enlightenment will have no downfalls. “

source: ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་ལྡན་པ་དང་། དག་པའི་སེམས་དང་ལྡན་པ་དང་། དགེ་བའི་སེམས་དང་ལྡན་པ་དང་། ཆོས་ལ་དགའ་བའི་སེམས་དང་ལྡན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སེམས་དང་ལྡན་པ་དང་། ས་དང་མཚུངས་པའི་སེམས་དང་ལྡན་པ་དང་། འཇིག་རྟེན་པའི་གཏམ་ལ་མངོན་པར་མི་དགའ་བའི་སེམས་དང་ལྡན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་གཏམ་ལ་མངོན་པར་དགའ་བའི་སེམས་དང་ལྡན་པ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བའི་སེམས་དང་ལྡན་པ་དང་། ཕུང་པོ་མེད་པ་ལ་རྟག་ཏུ་རབ་ཏུ་བརྩོན་པའི་སེམས་དང་ལྡན་པ་དང་། ན་བ་དང་། རྒ་བ་དང་། འཆི་བ་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སེམས་དང་ལྡན་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་སྲེག་པར་བྱེད་པའི་སེམས་དང་ལྡན་པ་དང་། ཀུན་ཏུ་སྦྱོར་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སེམས་དང་ལྡན་པ་དང་། ཆོས་ཐམས་ཅད་ལ་རློམ་སེམས་མེད་པའི་སེམས་དང་ལྡན་པ་དང་། བསམ་པའི་སྟོབས་ཅན་དང་། སྦྱོར་བའི་སྟོབས་ཅན་དང་། རྐྱེན་གྱི་སྟོབས་ཅན་དང་། སྨོན་ལམ་གྱི་སྟོབས་ཅན་དང་། སྙིང་པོ་མེད་པ་དང་། མ་འདྲེས་ཤིང་གོང་དུ་སྐྱོད་པར་བྱེད་པའི་སྟོབས་ཅན་དང་། ངེས་པར་རྟོགས་པའི་སྟོབས་ཅན་དང་། དགེ་བའི་རྩ་བའི་སྟོབས་ཅན་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཅན་དང་། ཐོས་པའི་སྟོབས་ཅན་དང་། གཏོང་བའི་སྟོབས་ཅན་དང་། ཚུལ་ཁྲིམས་ཀྱི་སྟོབས་ཅན་དང་། བཟོད་པའི་སྟོབས་ཅན་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཅན་དང་། བསམ་གཏན་གྱི་སྟོབས་ཅན་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ཅན་དང་། ཞི་གནས་ཀྱི་སྟོབས་ཅན་དང་། ལྷག་མཐོང་གི་སྟོབས་ཅན་དང་།
en: All those bodhisattvas have loving minds, affectionate minds, unpolluted minds, tamed minds, patient minds, settled minds, clear minds, imperturbable minds, pure minds, virtuous minds, Dharma-loving minds, minds that pacify the kleśas in all beings, minds as vast as the earth, minds that do not enjoy worldly conversation, minds that enjoy transcendent conversation, minds that strive for all virtuous qualities, minds that are sincerely, continuously dedicated, minds that have complete peace with regard to illness, aging, and death, minds that have incinerated all kleśas, minds that have pacified all involvements, and minds that are not proud of all their qualities. “

source: མངོན་པར་ཤེས་པའི་སྟོབས་ཅན་དང་། དྲན་པའི་སྟོབས་ཅན་དང་། བྱང་ཆུབ་ཀྱི་སྟོབས་ཅན་དང་། སྙིང་སྟོབས་ཀྱི་སྟོབས་ཅན་དང་། བདུད་ཐམས་ཅད་རྣམ་པར་འཇོམས་པའི་སྟོབས་ཅན་དང་། བདུད་ཀྱི་དཔུང་ཐམས་ཅད་རབ་ཏུ་འདུལ་བར་བྱེད་པའི་སྟོབས་ཅན་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅོད་པའི་སྟོབས་ཅན་དང་།
en: They possess the power of intention, the power of engagement, the power of motive, the power of prayer, the power of rising above the worthless, the power of comprehension, the power of good roots, the power of samādhi, the power of learning, the power of giving, the power of correct conduct, the power of patience, the power of diligence, the power of meditation, the power of wisdom, the power of śamatha, the power of vipaśyanā, the power of clairvoyance, the power of mindfulness, the power of enlightenment, the power of courage, the power of destroying all māras, the power of overcoming all the might of the māras, the power of defeating all promulgators of false doctrines through the Dharma, and the power of overcoming all kleśas. “

source: ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་འདུལ་བར་བྱེད་པའི་སྟོབས་ཅན་ཤ་སྟག་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་པད་མར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་ནི་སངས་རྒྱས་འབུམ་ཕྲག་མང་པོ་དག་ལ་ལྷག་པར་བྱ་བ་བྱས་ཤིང་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་བསྐྱེད་པ་ཡིན་ནོ།
en: The bodhisattva mahāsattvas who have been born and will be born in the Padmā world have served many hundreds of thousands of buddhas and thus have planted good roots. “

source: །སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་དེར། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་འདི་ལྟ་སྟེ། དཔེར་ན་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཁམ་གྱིས་ཟ་བའི་ཟས་མེད་པ་བཞིན་དུ་བསམ་གཏན་གྱི་ཟས་དང་། ཆོས་ཀྱི་ཟས་དང་།
en: The bodhisattva mahāsattvas who have been born and will be born in the buddha realm of the Padmā world consume meditation as food, Dharma as food, and inhaled aromas as food, just like the deities in the Brahmā paradise.

source: དྲི་ཟའི་ཟས་དང་ལྡན་པ་མ་ཡིན་ནོ།
en: Food eaten through the mouth is unknown there. “

source: །དེ་ན་རྣམ་པ་ཐམས་ཅད་དུ་མི་དགེ་བའི་མིང་ཡང་མེད་དོ།
en: Even the word nonvirtue does not exist there at all.

source: །དེ་ན་རྣམ་པ་ཐམས་ཅད་དུ་བུད་མེད་ཀྱི་མིང་ཡང་མེད་གདགས་པ་ཡང་མེད་དོ།
en: Even the word female does not exist there at all; there isn’t even that term.

source: །དེ་ན་རྣམ་པ་ཐམས་ཅད་དུ་སྡུག་བསྔལ་གྱི་སྒྲ་ཡང་མེད་པ་རྣམ་པ་ཐམས་ཅད་དུ་དགེ་བ་དང་མི་དགེ་བའི་སྒྲ་ཡང་མེད་དོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ་ཉོན་མོངས་པའི་སྒྲ་ཡང་མེད། ཡོངས་སུ་འཛིན་པ་ཡང་མེད་དོ། །དེ་ན་མུན་པ་ཡང་མེད། དྲི་མ་ཡང་མེད་དོ།
en: Even the word suffering does not exist there at all. Even the words virtue and nonvirtue do not exist there at all. “

source: །སེམས་ངལ་བ་ཡང་མེད་དོ། །ལུས་ངལ་བ་ཡང་མེད་དོ། །སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྒྲ་ཡང་མེད་དོ།
en: And in the same way the words kleśa, attachment, darkness, bad smell,mental fatigue, and physical fatigue, and the words hells, animal birth, and Yama’s world do not exist there.

source: །ངན་སོང་དུ་གདགས་པ་ཡང་མེད་དོ། །ཚེར་མ་དང་། ཐིབས་པོ་དང་། རྡོ་བ་དང་། གསེག་མ་ཡང་མེད་དོ།
en: The words unfortunate rebirths do not exist there. “

source: །མེ་ཡང་མེད། ཉི་མ་དང་ཟླ་བ་ཡང་མེད། སྐར་མའི་གཟུགས་ཀྱང་མེད་དོ། །རྒྱ་མཚོ་ཆེན་པོ་ཡང་མེད། རི་རབ་ཀྱང་མེད། ཁོར་ཡུག་གི་རི་ཡང་མེད། འཇིག་རྟེན་གྱི་བར་ཡང་མེད། རི་ནག་པོ་རྣམས་ཀྱང་མེད་དོ། །རྡོ་བ་མི་གཙང་བ་དག་ཀྱང་མེད།
en: There are no thorns, dark places, stones, or pebbles; there is no fire, no moon, no sun, no stars, and no great oceans; and there are no Sumeru or Cakravāḍa mountains, no in-between worlds, no Kāla mountains, no Mīḍhapāṣāṇa, and no Pāṃśu mountains.

source: རྡུལ་གྱི་རི་ཡང་མེད་དོ། །སྤྲིན་དང་ཆར་པའི་སྒྲ་ཡང་མེད། རླུང་མར་གྱི་སྒྲ་ཡང་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་དུ་ངན་སོང་གི་སྒྲ་ཡང་མེད། རྣམ་པ་ཐམས་ཅད་དུ་མི་ཁོམ་པའི་སྒྲ་ཡང་མེད་དོ།
en: There aren’t the words clouds or rain, or the word storm; the words unfortunate existences don’t exist at all. “

source: །གཞན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ནི་སངས་རྒྱས་ཀྱི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའི་འོད་དང་། བསོད་ནམས་ཀྱི་འོད་དང་། རིན་པོ་ཆེའི་འོད་ཀྱི་སྣང་བ་རྒྱ་ཆེན་པོས་རྟག་ཏུ་གསལ་བར་གྱུར་ཏོ།
en: Moreover, the Padmā realm is always illuminated by the vast radiance of the light from the Buddha, the light from the bodhisattvas, the light from merit, and the light from jewels. “

source: །དེ་ན་བྱ་འབྲས་བུ་དང་བཅས་པ་ཞེས་བྱ་བ་དག་རང་རང་གི་སྒྲ་འཇམ་ཞིང་ཡིད་དུ་འོང་བ་དག་གིས་དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དག་རབ་ཏུ་སྒྲོགས་པར་བྱེད་དོ།
en: There are the birds that are called saphala, each of which, with their own pleasing and gentle song, sings of the powers, the strengths, and the aspects of enlightenment.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་དེ་ཆེ་ཁྱད་ནི་ཇི་ཙམ་ཞིག་ལགས། གོང་མ་དང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Then the bodhisattva Ratnavairocana asked the Bhagavat, “Bhagavat, how vast is the Padmā realm?

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། རིང་པོ་མ་ལགས་པའི་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པ་དེ་ཡང་ཡུན་ཇི་སྲིད་ཅིག་ཏུ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་སྟོན་པར་འགྱུར།
en: How long after his swift attainment of the enlightenment of buddhahood will Padmottara reside, live, and remain there, teaching the Dharma?

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ནི་དམ་པའི་ཆོས་ཡུན་ཇི་སྲིད་ཅིག་ཏུ་གནས་པར་འགྱུར།
en: When he has passed into parinirvāṇa, how long will his Dharma remain?

source: འཇིག་རྟེན་གྱི་ཁམས་པད་མའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་ནི་ཡུན་ཇི་སྲིད་ཅིག་ཏུ་གནས་པར་འགྱུར།
en: How long will those bodhisattvas who have been born and will be born in the buddha realm of the Padmā world remain there?

source: ཅི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སངས་རྒྱས་ལ་ལྟ་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བགྱིད་པ་དང་མི་འབྲལ་ལགས་སམ་འོན་ཏེ་དེ་ལྟ་མ་ལགས།
en: Are those bodhisattvas deprived of seeing the Buddha, hearing the Dharma, and serving the Saṅgha, or not?

source: འཇིག་རྟེན་གྱི་ཁམས་པད་མ་དེ་ནི་སྔོན་མིང་ཅི་ཞེས་བགྱི་བར་གྱུར།
en: What was the name of the Padmā realm previously?

source: དེར་རྒྱལ་བའི་ཉི་མ་ནུབ་ནས་ཡུན་ཇི་སྲིད་ཅིག་ལགས་ནས།
en: How long after the setting of the sun of the previous jina did the Tathāgata Padmottara attain the complete enlightenment of perfect buddhahood?

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཅིའི་རྐྱེན་གྱིས་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཆོ་འཕྲུལ་དག་མཛད་པའི་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དག་དང་། སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་དག་ཁ་ཅིག་གིས་ནི་མཐོང་ལ། ཁ་ཅིག་གིས་ནི་མི་མཐོང་བར་གྱུར་ལགས།
en: Why is it that some see the manifestations of buddhas, the miracles of buddhas, and the bhagavat buddhas performing miracles in other buddha realms in the ten directions, while others do not?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རིའི་རྒྱལ་པོ་རི་རབ་ལ་འཕང་དུ་ནི་དཔག་ཚད་འབུམ་དྲུག་ཁྲི་བརྒྱད་སྟོང་ཡོད་ལ། རྒྱར་ནི་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་པ་སྐྱེས་བུ་བརྩོན་འགྲུས་དང་ལྡན་པ།
en: Noble son,” answered the Bhagavat, “it is like this: Sumeru, the king of mountains, is 168,000 yojanas high and 84,000 yojanas wide.

source: སྟོབས་དང་ལྡན་པ་ལ་ལ་ཞིག་འོངས་ནས་ཏིང་ངེ་འཛིན་གྱི་མཐུས་རིའི་རྒྱལ་པོ་རི་རབ་དེ་ཡུངས་འབྲུའི་ཚད་ཙམ་དུ་བཀྲུམ་ནས།
en: If a diligent, powerful man came to Sumeru, the king of mountains, and with the power of his samādhi broke it into pieces the size of mustard seeds, then those pieces would be uncountable.

source: ཡུངས་འབྲུ་ཙམ་དུ་གྱུར་པ་དེ་དག་ནི་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པས་ན་ཡུངས་འབྲུ་ཙམ་པོ་དེ་དག་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མ་གཏོགས་པར་སུས་ཀྱང་བགྲང་བར་མི་ནུས་ཏེ།
en: No one but a being with omniscient wisdom could count those pieces of Sumeru that are the size of mustard seeds.

source: ཡུངས་འབྲུ་ཙམ་པོ་དེ་དག་ཇི་སྙེད་པར་དེ་ན་གླིང་བཞི་པའི་ཚད་ཀྱང་དེ་སྙེད་ཡོད་དོ།
en: That number of those pieces is the number of how many four-continent worlds there are. “

source: །འདི་ལྟ་སྟེ་དཔེར་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཀུན་ཏུ་གང་བ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་པད་མ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཀུན་ཏུ་གང་བ་ཡིན་ནོ།
en: It is like this: just as the world of Sukhāvatī is completely filled with bodhisattvas, in the same way the buddha realm Padmā is completely filled with bodhisattvas. “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པའི་སྐུ་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་སུམ་ཅུར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པར་འགྱུར་རོ།
en: Noble son, the tathāgata arhat samyaksam­buddha Padmottara will have a lifespan of thirty intermediate eons, during which he will reside, live, and remain there, teaching the Dharma. “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དམ་པའི་ཆོས་ནི་བར་གྱི་བསྐལ་པ་བཅུར་གནས་པར་འགྱུར་རོ།
en: Noble son, after the tathāgata arhat samyaksam­buddha Padmottara has passed into parinirvāṇa, the sacred Dharma will remain for ten intermediate eons.

source: །འཇིག་རྟེན་གྱི་ཁམས་པད་མར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་གི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བཞི་བཅུར་འགྱུར་རོ།
en: The lifespan of the bodhisattva mahāsattvas who have been born and will be born in the Padmā realm is forty intermediate eons. “

source: །རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་དེ་སྔོན་ནི་ཙན་དན་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: Noble son, previously the Padmā realm was called Candanā.

source: ད་ལྟར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ལྟར་ཡོངས་སུ་དག་པར་ཡང་མ་གྱུར་ལ། དེ་ལྟར་སེམས་ཅན་དག་པ་དག་གིས་གང་བར་ཡང་མ་གྱུར་ཏོ།
en: It was not completely pure, nor filled with pure beings, as the present Padmā world is. “

source: །རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་ཙན་དན་དུ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དང་ལྡན་པར་གྱུར་ཏེ།
en: Noble son, in the Candanā world there dwelt the tathāgata arhat samyaksam­buddha, the one with wisdom and virtuous conduct, the sugata, the knower of the world, the unsurpassable guide who tames beings, the teacher of gods and humans, the bhagavat buddha named Candrottama.

source: དེས་ཀྱང་བར་གྱི་བསྐལ་པ་སུམ་ཅུར་ཆོས་བསྟན་པར་གྱུར་ཏོ།
en: He taught the Dharma for thirty intermediate eons.

source: །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དུས་ཀྱི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་ནི་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ཏུ་དོང་ངོ་།
en: When the time came for him to pass into parinirvāṇa, some bodhisattvas, through the power of their prayers, departed to other buddha realms.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྷག་མ་གང་དག་དེ་ན་འཁོད་པ་དེ་དག་ནི་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པ་ནི་དོ་མོད་ནམ་གྱི་གུང་ཐུན་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: The bodhisattvas who remained thought, ‘The tathāgata arhat samyaksam­buddha Candrottama will pass into parinirvāṇa in the middle watch of this night.

source: །བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དམ་པའི་ཆོས་ནི་བར་གྱི་བསྐལ་པ་བཅུར་གནས་པར་གྱུར་ན་དམ་པའི་ཆོས་ནུབ་པའི་འོག་ཏུ་སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ།
en: After the Bhagavat has passed into parinirvāṇa, his sacred Dharma will remain for ten intermediate eons. After it has come to an end, who will attain the complete enlightenment of perfect buddhahood?’ “

source: །ཡང་དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་ཕྱག་རྒྱ་ཞེས་བྱ་བ་དེ་སྔོན་གྱི་སྨོན་ལམ་གྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པ་ལུང་བསྟན་པར་གྱུར་ཏེ། རིགས་ཀྱི་བུ་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ནི་བར་གྱི་བསྐལ་པ་བཅུར་གནས་པར་འགྱུར་ཏེ།
en: At that time, the bodhisattva mahāsattva Gaganamudra, because of his prayers in the past, received this prophecy from the tathāgata arhat samyaksam­buddha Candrottama: ‘Noble son, when I have passed into parinirvāṇa, the Dharma will remain for ten intermediate eons, and then my Dharma will come to an end in the middle period of the night.

source: ནམ་གྱི་གུང་ཐུན་ལ་ངའི་དམ་པའི་ཆོས་ནུབ་པར་གྱུར་ནས་དེ་ཉིད་ཀྱི་ནུབ་མོའི་ཐུན་ཐ་མ་ལ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: In the last period of that night, you will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ།
en: You will become the tathāgata arhat samyaksam­buddha, the one with wisdom and virtuous conduct, and so on, the bhagavat buddha named Padmottara.’ “

source: །དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པ་ག་ལ་བ་དེར་སོང་སྟེ།
en: At that time, the bodhisattva mahāsattvas came to the bhagavat tathāgata arhat samyaksam­buddha Candrottama.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་དམ་པའི་དྲུང་དུ་ལྷགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་དེ་བཞིན་གཤེགས་པ་ཟླ་བ་དམ་པ་ལ་མཆོད་དེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་འགོག་པ་ལ་མཉམ་པར་བཞག་པའི་སེམས་ཀྱིས་བསྐལ་པ་བར་མ་བཅུ་པོ་དེ་དག་འདའ་བར་བགྱི་བར་འཚལ་ལགས་སོ།
en: When they had come before the bhagavat tathāgata arhat samyaksam­buddha Candrottama, through the power of samādhi, with manifold bodhisattva miracles, all those bodhisattvas made offerings to the Tathāgata Candrottama, circumambulated him three times, and then said to the Bhagavat, ‘Bhadanta Bhagavat, we will remain, with our minds in a state of cessation, for those ten intermediate eons.’ “
